using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data.Entity;
using System.IO;
using System.Linq;
using System.Web;
using DeltaDucks.Data.Properties;
using DeltaDucks.Models;
using Microsoft.AspNet.Identity;
using Microsoft.AspNet.Identity.EntityFramework;

namespace DeltaDucks.Data
{
    public class SeedData : DropCreateDatabaseAlways<DeltaDucksContext>
    {
        protected override void Seed(DeltaDucksContext context)
        {
            GetTowns().ForEach(town => context.Towns.Add(town));
            context.Commit();
            GetLocations(context).ForEach(location => context.Locations.Add(location));
            context.Commit();
            GetLandmarks().ForEach(landmark => context.Landmarks.Add(landmark));
            GetPictures().ForEach(picture => context.Pictures.Add(picture));

            var users = GetUsers(context);
            GetComments(users).ForEach(comment => context.Comments.Add(comment));

            // ADDITION OF ROLES 
            //GetAdminUsers().ForEach(u => context.Users.Add(u));
            //context.Commit();
            //GetRoles().ForEach(r => context.Roles.Add(r));
            //context.Commit();
            //AsignAdminRole().ForEach(ar => context.Roles.FirstOrDefault(r => r.Name == "Admin").Users.Add(ar));
            //context.Commit();

        }
#region Towns
        private static List<Town> GetTowns()
        {
            var list = new List<Town>
            {
                new Town
                {
                    Name = "гр. Банско"
                },
                new Town
                {
                    Name = "Пирин"
                },
                new Town
                {
                    Name = "с. Добърско"
                },
                new Town
                {
                    Name = "гр. Мелник"
                },
                new Town
                {
                    Name = "гр. Петрич"
                },
                new Town
                {
                    Name = "гр. Несебър"
                },
                new Town
                {
                    Name = "гр. Поморие"
                },
                new Town
                {
                    Name = "гр. Бургас"
                },
                new Town
                {
                    Name = "гр. Малко Търново"
                },
                new Town
                {
                    Name = "гр. Созопол"
                },
                new Town
                {
                    Name = "гр. Царево"
                },
                new Town
                {
                    Name = "гр. Варна"
                },
                new Town
                {
                    Name = "гр. Девня"
                },
                new Town
                {
                    Name = "гр. Велико Търново"
                },
                new Town
                {
                    Name = "гр. Свищов"
                },
                new Town
                {
                    Name = "гр. Видин"
                },
                new Town
                {
                    Name = "гр. Белоградчик"
                },
                new Town
                {
                    Name = "гр. Враца"
                },
                new Town
                {
                    Name = "гр. Козлодуй"
                },
                new Town
                {
                    Name = "гр. Габрово"
                },
                new Town
                {
                    Name = "с. Боженци"
                },
                new Town
                {
                    Name = "гр. Трявна"
                },
                new Town
                {
                    Name = "гр. Добрич"
                },
                new Town
                {
                    Name = "гр. Балчик"
                },
                new Town
                {
                    Name = "гр. Каварна"
                },
                new Town
                {
                    Name = "гр. Кърджали"
                },
                new Town
                {
                    Name = "гр. Кюстендил"
                },
                new Town
                {
                    Name = "гр. Благоевград"
                },
                new Town
                {
                    Name = "Осоговска планина"
                },
                new Town
                {
                    Name = "Рила"
                },
                new Town
                {
                    Name = "гр. Ловеч"
                },
                new Town
                {
                    Name = "гр. Луковит"
                },
                new Town
                {
                    Name = "гр. Троян"
                },
                new Town
                {
                    Name = "гр. Тетевен"
                },
                new Town
                {
                    Name = "с. Брестница"
                },
                new Town
                {
                    Name = "гр. Берковица"
                },
                new Town
                {
                    Name = "гр. Пазарджик"
                },
                new Town
                {
                    Name = "гр. Панагюрище"
                },
                new Town
                {
                    Name = "гр. Пещера"
                },
                new Town
                {
                    Name = "гр. Батак"
                },
                new Town
                {
                    Name = "гр. Трън"
                },
                new Town
                {
                    Name = "гр. Перник"
                },
                new Town
                {
                    Name = "гр. Плевен"
                },
                new Town
                {
                    Name = "гр. Пловдив"
                },
                new Town
                {
                    Name = "гр. Перущица"
                },
                new Town
                {
                    Name = "гр. Сопот"
                },
                new Town
                {
                    Name = "гр. Карлово"
                },
                new Town
                {
                    Name = "гр. Калофер"
                },
                new Town
                {
                    Name = "гр. Сандански"
                },
                new Town
                {
                    Name = "Стара планина"
                },
                new Town
                {
                    Name = "гр. Асеновград"
                },
                new Town
                {
                    Name = "гр. Разград"
                },
                new Town
                {
                    Name = "гр. Исперих"
                },
                new Town
                {
                    Name = "гр. Русе"
                },
                new Town
                {
                    Name = "гр. Бяла"
                },
                new Town
                {
                    Name = "гр. Силистра"
                },
                new Town
                {
                    Name = "гр. Сребърна"
                },
                new Town
                {
                    Name = "гр. Тутракан"
                },
                new Town
                {
                    Name = "гр. Сливен"
                },
                new Town
                {
                    Name = "гр. Велинград"
                },
                new Town
                {
                    Name = "гр. Котел"
                },
                new Town
                {
                    Name = "с. Жеравна"
                },
                new Town
                {
                    Name = "гр. София"
                },
                new Town
                {
                    Name = "гр. Етрополе"
                },
                new Town
                {
                    Name = "гр. Гоце Делчев"
                },
                new Town
                {
                    Name = "гр. Елена"
                },
                new Town
                {
                    Name = "с. Кръстевич"
                },
                new Town
                {
                    Name = "гр. Хисаря"
                },
                new Town
                {
                    Name = "гр. Чипровци"
                },
                new Town
                {
                    Name = "гр. Брацигово"
                },
                new Town
                {
                    Name = "гр. Чирпан"
                },
                new Town
                {
                    Name = "гр. Елена"
                },
                new Town
                {
                    Name = "гр. Хасково"
                },
                new Town
                {
                    Name = "гр. Ивайловград"
                },
                new Town
                {
                    Name = "гр. Димитровград"
                },
                new Town
                {
                    Name = "Витоша"
                },
                new Town
                {
                    Name = "гр. Копривщица"
                },
                new Town
                {
                    Name = "гр. Нова Загора"
                },
                new Town
                {
                    Name = "гр. Клисура"
                },
                new Town
                {
                    Name = "гр. Копривщица"
                },
                new Town
                {
                    Name = "с. Осеновлаг"
                },
                new Town
                {
                    Name = "гр. Самоков"
                },
                new Town
                {
                    Name = "гр. Търговище"
                },
                new Town
                {
                    Name = "гр. Самоков"
                },
                new Town
                {
                    Name = "гр. Ботевград"
                },
                new Town
                {
                    Name = "гр. Смолян"
                },
                new Town
                {
                    Name = "с. Момчиловци"
                },
                new Town
                {
                    Name = "Пампорово"
                },
                new Town
                {
                    Name = "Родопи"
                },
                new Town
                {
                    Name = "гр. Златоград"
                },
                new Town
                {
                    Name = "с. Широка Лъка"
                },
                new Town
                {
                    Name = "гр. Мадан"
                },
                new Town
                {
                    Name = "гр. Девин"
                },
                new Town
                {
                    Name = "гр. Стара Загора"
                },
                new Town
                {
                    Name = "гр. Казанлък"
                },
                new Town
                {
                    Name = "гр. Шипка"
                },
                new Town
                {
                    Name = "гр. Шумен"
                },
                new Town
                {
                    Name = "гр. Плиска"
                },
                new Town
                {
                    Name = "с. Мадара"
                },
                new Town
                {
                    Name = "гр. Велики Преслав"
                },
                new Town
                {
                    Name = "гр. Елхово"
                },
                new Town
                {
                    Name = "гр. Ямбол"
                },
                new Town
                {
                    Name = "гр. Дряново"
                },
                new Town
                {
                    Name = "с. Стоб"
                }
            }.Distinct();

            return list.ToList();
        }
        #endregion

#region Locations
        private static List<Location> GetLocations(DeltaDucksContext context)
        {
            return new List<Location>
            {
                new Location
                {
                    Latitude = 42.6892896,
                    Longitude = 23.3218674,
                    TownId = 1
                },
                new Location
                {
                    Latitude = 41.767222,
                    Longitude = 23.3967001,
                    TownId = 2
                },
                new Location
                {
                    Latitude = 41.970058,
                    Longitude = 23.477194,
                    TownId = 3
                },
                new Location
                {
                    Latitude = 41.5231612,
                    Longitude = 23.3982906,
                    TownId = 4
                },
                new Location
                {
                    Latitude = 41.444126,
                    Longitude = 23.239662,
                    TownId = 5
                },
                new Location
                {
                    Latitude = 41.4042377,
                    Longitude = 23.0150922,
                    TownId = 5
                },
                new Location
                {
                    Latitude = 42.6583164,
                    Longitude = 23.730732,
                    TownId = 6
                },
                new Location
                {
                    Latitude = 42.565577,
                    Longitude = 27.6318675,
                    TownId = 7
                },
                new Location
                {
                    Latitude = 42.5907597,
                    Longitude = 27.5874142,
                    TownId = 7
                },
                new Location
                {
                    Latitude = 42.4463412,
                    Longitude = 27.4625411,
                    TownId = 8
                },
                new Location
                {
                    Latitude = 41.979991,
                    Longitude = 27.524679,
                    TownId = 9
                },
                new Location
                {
                    Latitude = 42.420425,
                    Longitude = 27.692867,
                    TownId = 10
                },
                new Location
                {
                    Latitude = 42.1715358,
                    Longitude = 27.8522611,
                    TownId = 11
                },
                new Location
                {
                    Latitude = 43.200318,
                    Longitude = 27.9215004,
                    TownId = 12
                },
                new Location
                {
                    Latitude = 43.225442,
                    Longitude = 27.5849247,
                    TownId = 13
                },
                new Location
                {
                    Latitude = 43.0837812,
                    Longitude = 25.6520446,
                    TownId = 14
                },
                new Location
                {
                    Latitude = 43.095609,
                    Longitude = 25.663183,
                    TownId = 14
                },
                new Location
                {
                    Latitude = 43.6205982,
                    Longitude = 25.3400556,
                    TownId = 15
                },
                new Location
                {
                    Latitude = 43.993026,
                    Longitude = 22.864998,
                    TownId = 16
                },
                new Location
                {
                    Latitude = 43.7280314,
                    Longitude = 22.5829063,
                    TownId = 50
                },
                new Location
                {
                    Latitude = 43.6115544,
                    Longitude = 22.6771202,
                    TownId = 17
                    //Белоградчишски скали
                },
                new Location
                {
                    Latitude = 43.2044194,
                    Longitude = 23.4936989,
                    TownId = 18
                    //Леденика
                },
                new Location
                {
                    Latitude = 43.151,
                    Longitude = 23.5778113,
                    TownId = 18
                    //Околчица
                },
                new Location
                {
                    Latitude = 43.798718,
                    Longitude = 23.6776728,
                    TownId = 19
                    //Радецки
                },
                new Location
                {
                    Latitude = 42.8705605,
                    Longitude = 25.3168318,
                    TownId = 20
                    //Музей на образованието, Габрово
                },
                new Location
                {
                    Latitude = 42.873031,
                    Longitude = 25.424006,
                    TownId = 21
                    //АИР Боженци
                },
                new Location
                {
                    Latitude = 42.8676041,
                    Longitude = 25.4874226,
                    TownId = 22
                    //Трявна, Даскалова къща
                },
                new Location
                {
                    Latitude = 42.9500327,
                    Longitude = 25.4323938,
                    TownId = 103
                    //Дряновски манастир
                },
                new Location
                {
                    Latitude = 42.9795702,
                    Longitude = 25.4770053,
                    TownId = 103
                    //гр. Дряново – Музей „Кольо Фичето“
                },
                new Location
                {
                    Latitude = 43.4031288,
                    Longitude = 28.1456719,
                    TownId = 24
                    //гр. Балчик – комплекс „Двореца“
                },
                new Location
                {
                    Latitude = 43.4139288,
                    Longitude = 28.354459,
                    TownId = 25
                    //нос Калиакра-археологически резерват „Калиакра”
                },
                new Location
                {
                    Latitude = 41.6264152,
                    Longitude = 25.3701454,
                    TownId = 26
                    //гр. Кърджали – Манастир „Св. Йоан Предтеча“
                },
                new Location
                {
                    Latitude = 41.7154279,
                    Longitude = 25.4656735,
                    TownId = 26
                    //Kърджали, Перперикон
                },
                new Location
                {
                    Latitude = 42.2835244,
                    Longitude = 22.68874,
                    TownId = 27
                    //гр. Кюстендил - Къща-музей „Димитър Пешев“
                },
                new Location
                {
                    Latitude = 42.0204962,
                    Longitude = 23.1031504,
                    TownId = 28
                    //гр. Благоевград - Регионален исторически музей
                },
                new Location
                {
                    Latitude = 42.158024,
                    Longitude = 22.5140893,
                    TownId = 29
                    //връх Руен
                },
                new Location
                {
                    Latitude = 42.1333838,
                    Longitude = 23.3401215,
                    TownId = 30
                    //Музей Рилски манастир в Рилска света обител
                },
                new Location
                {
                    Latitude = 42.0964618,
                    Longitude = 23.1130692,
                    TownId = 104
                    //Стобски пирамиди - с. Стоб
                },
                new Location
                {
                    Latitude = 42.2305238,
                    Longitude = 23.3036197,
                    TownId = 30
                    //хижа „Скакавица“ и Седемте рилски езера
                },
                new Location
                {
                    Latitude = 43.129946,
                    Longitude = 24.7174735,
                    TownId = 31
                    //гр. Ловеч – Музей „Васил Левски“
                },
                new Location
                {
                    Latitude = 43.2077,
                    Longitude = 24.1585,
                    TownId = 32
                    // гр. Луковит – Национален пещерен дом
                },
                new Location
                {
                    Latitude = 42.8413752,
                    Longitude = 24.7680955,
                    TownId = 33
                    //Природонаучен музей - с. Черни Осъм
                },
                new Location
                {
                    Latitude = 42.918321,
                    Longitude = 24.264804,
                    TownId = 34
                    //гр. Тетевен – Исторически музей (осн. 1911 г.)
                },
                new Location
                {
                    Latitude = 43.0471357,
                    Longitude = 24.1854932,
                    TownId = 35
                    //с. Брестница – пещера „Съева дупка“ (400 м.)
                },
                new Location
                {
                    Latitude = 43.2392278,
                    Longitude = 23.1260618,
                    TownId = 36
                    //гр. Берковица – Етнографски музей
                },
                new Location
                {
                    Latitude = 42.1864485,
                    Longitude = 24.3252059,
                    TownId = 37
                    //гр. Пазарджик – Къща-музей „Станислав Доспевски”
                },
                new Location
                {
                    Latitude = 42.5375145,
                    Longitude = 24.116351,
                    TownId = 38
                    //Оборище
                },
                new Location
                {
                    Latitude = 42.00042201,
                    Longitude = 24.27872,
                    TownId = 39
                    //Пещера, Снежанка
                },
                new Location
                {
                    Latitude = 41.9428527,
                    Longitude = 24.2184775,
                    TownId = 40
                    //Музей в Батак
                },
                new Location
                {
                    Latitude = 42.8619908,
                    Longitude = 22.6502499,
                    TownId = 41
                    //Ждрело на река Ерма
                }
            };
        }
        #endregion

#region Landmarks
        private static List<Landmark> GetLandmarks()
        {
            return new List<Landmark>
            {
                new Landmark
                {
                    Name = "Музей \"Никола Вапцаров\"",
                    Number = 1,
                    Description = "Родната къща на поета Никола Вапцаров е превърната в музей през 1952г. " +
                                  "След 3 реконструкции - 1960, 1979 и 1992 г. - сегашната експозиция е направена " +
                                  "на високо професионално ниво и се отличава с нетрадиционния за мемориален " +
                                  "музей метод на поднасяне на информацията.",
                    Information = "По указания на членовете на семейството на поета - майка му Елена, " +
                                  "брат му Борис и сестра му Райна - отчасти е възстановена домашнобитовата среда и обстановката по време на неговото детство." +
                                  " Музея има 3 функционални части - видеозала в 2 помещения /с капацитет 40 места/, " +
                                  "където е представено и родословното дърво на поета; " +
                                  "автентична етнографска експозиция и видеозала - " +
                                  "\"Поезията на Вапцаров\". В музея са изложени и копия от ръкописите на " +
                                  "Вапцаров, първите публикации на неговите стихове, " +
                                  "събрани по-късно в отделна стихосбирка. " +
                                  "Във витрина се пазят костюмът, ризата и часовникът, носени от поета преди разстрела. " +
                                  "Музеят разполага с готови беседи чрез видеоматериал на английски, немски, френски и руски език. " +
                                  "Къщата-музей е обединена в един комплекс с Дома на изкуствата и поезията.",
                    LocationId = 1
                    // Град Банско
                },
                new Landmark
                {
                    Name = "Връх Вихрен",
                    Number = 2,
                    Description = "Връх Вихрен е висок 2914 м. На 1950 м. има метеорологична станция. " +
                                  "Средните годишни валежи са 1150 мм, " +
                                  "а снежната покривка достига до 3 м. " +
                                  "Вихрен със своите 2914 метра е първенецът на Пирин. ",
                    Information = "Траките наричали планината Орбелос /белоснежна/, " +
                                  "а славяните отнача¬ло я назовавали Юденица /Самодивската/, " +
                                  "а по-късно Перин, защото били убедени, че най-високият й връх е обитаван от самия бог Перун. " +
                                  "според тълкуването на академик Владимир Георгиев името идва от тракийската дума „перинтос\", " +
                                  "което означава „скала\", или от хетската „перунаш\". " +
                                  "До 1942 година Вихрен се е наричал Елтепе /връх на бурите/. " +
                                  "Той е част от създадения в 1962 година едноименен национален парк, " +
                                  "който в 1975 година получава името „Пирин\". С площ от над 40,000 " +
                                  "хектара паркът опазва уникалните ендемични, застрашени и редки растения, " +
                                  "както и разнообразието от животински видове, които го обитават. " +
                                  "През 1983 година е включен в списъка на световното природно и културно наследство на ЮНЕСКО." +
                                  "В подножието на планината се отбийте да видите Байкушевата мура, " +
                                  "която носи името на своя откривател, лесовъда Коста Байкушев. " +
                                  "Той изследва дървото през 1897 година и изчислява възрастта му на 1,200 години тогава. " +
                                  "Размерите му са наистина впечатляващи: височина 24 метра, диаметър 2 метра и 2- сантиметра " +
                                  "и обиколка почти осем. Пирин е изключително богат на живот. " +
                                  "1300 вида са висшите растения /което е една трета от всички познати в България/, " +
                                  "320 вида мъхове и няколкостотин вида водорасли. 18 на брой са локалните ендемитни растения, " +
                                  "които се срещат само в Пирин. Още по-голямо е богатството от животински видове. " +
                                  "Но не така стоят нещата при Вихрен. Защото той е втори по височина в България след Мусала " +
                                  "и трети на Балканския полуостров след Митикас в Олимп /Гърция/. " +
                                  "Изграден е от мрамори, които не задържат вода и точно затова в района на върха няма реки и" +
                                  " езера. Растителността по склоновете му е бедна - трева и лишеи, но в замяна на това " +
                                  "по скалния ръб Джамджиеви скали в изобилие се среща еделвайсът. " +
                                  "По-богат е животинският свят - птици, дребни гризачи, но най-вече диви кози, които обитават " +
                                  "местността Казаните в неговото подножие. Към самия връх водят няколко маршрута, " +
                                  "но е най-добре да се тръгне от Банско към хижите „Бъндерица\" и „Вихрен\", " +
                                  "които предлагат много добри условия за пребиваване.От хижа „Вихрен\" започва така " +
                                  "нареченият „класически маршрут\"-основната пътека, известна като Царската. " +
                                  "Но е хубаво да имате известна физическа подготовка, защото пътеката е стръмна -" +
                                  " за кратко време се достига денивелация от почти километър нагоре. " +
                                  "През лятото изкачването от хижата до върха трае около 3-4 часа, в зависимост от " +
                                  "физическата кондиция на туристите. Безспорно именно тогава е най-доброто време за " +
                                  "достигане челото на Вихрен. Не забравяйте добрата екипировка, защото в тази, " +
                                  "пък и не само в тази планина времето даже през най-благоприятния сезон може да се промени " +
                                  "бързо и рязко. Добре е и в хижата да са уведомени за вашето начинание, " +
                                  "а батерията на мобилния ви телефон да бъде добре заредена. Но усилието си струва, " +
                                  "защото ще бъдете богато възнаградени за него. От изключителната красота на Пирин - " +
                                  "тази уж малка и компактна, но покоряваща с величието си планина. " +
                                  "Ще откриете много очарование в дълбоките долини на Влахинска и Бъндеришка река, " +
                                  "в смълчаните клекове, в играта на светлината и сенките. Средният годишен абсолютен минимум на " +
                                  "температурите е между (- 25 С) и (-21 С), а максималните температури са между 15 С и 23 С. " +
                                  "До Вихрен може да се стигне по много пътища, но най-удобен и популярен е маршрутът от Банско.",
                    LocationId = 2
                    // Пирин
                },
                new Landmark
                {
                    Name = "Църква \"Св.св. Теодор Тирон и Теодор Стратилат\"",
                    Number = 3,
                    Description =
                        "Добърско е малко планинско село в Разложката котловина. То е старинно българско селище." +
                        " Разположено е на предната" +
                        " част на планински хребет в южна Рила, място с надморска височина около 1000 м. ",
                    Information = "Един от добре запазените паметници на културата в Добърско е старата църква " +
                                  "\"Свети Теодор Тирон и Теодор Стратилат\" - 1614 г. Според една жизнена и днес легенда " +
                                  "село Добърско било заселено от част от ослепените войници на цар Самуил след битката при " +
                                  "село Ключ през 1014 година, дошли да дирят облекчение на своите болки от местно лековито " +
                                  "изворче. Но истинската причина, поради която всеки бъпгарин трябва да посети това селце, " +
                                  "което е само на 17 километра северно от общинския център - гр. Разлог, е необикновената " +
                                  "черква със скромни размери, но с неоценима духовна стойност. Построена и изрисувана през " +
                                  "1614 година, тя е дълга осем и половина метра, широка почти седем и висока едва пет, " +
                                  "с двускатен покрив, съобразно тогавашното османско законодателство. Но майсторите дръзко " +
                                  "издълбали два кръста на нейната фасада. Както и свастика в един от каменните блокове. " +
                                  "Този символ на слънцето и благоденствието е с древен ирански произход и според учените е " +
                                  "дошъл тук с първите войнишки семейства - верните до смърт на българската държава прабългари, " +
                                  "заселени на границата с Византия. Почти всички надписи по фреските са на български език, " +
                                  "въпреки че официален в църковните институции по това време е гръцкият. И нещо особено " +
                                  "любопитно: в два стенописа, особено в сцената \"Преображение Господне\", Исус Христос " +
                                  "отлита към небето с нещо, което по форма наподобява съвременна космическа ракета. " +
                                  "Спед писанията на швейцареца Ерих фон Деникен мнозина привърженици у нас на хипотезата " +
                                  "за посещения на извънземни жители са склонни да ги приемат за чиста истина, като дори " +
                                  "различават в тази фреска струите на реактивните двигатели. Но подобни изображения на „ракети\"" +
                                  " в кавички има и в още няколко български църкви от тази епоха. " +
                                  "Необичайно е вътрешното разпределение на църквата: вместо еднокорабна " +
                                  "строителите са изградили сложна трикорабна базилика, тип, характерен за " +
                                  "Първото българско царство /9-11 век/. Което идва да подскаже, че през 17 " +
                                  "век строителите най-вероятно са възстановили църква, построена на същото място през " +
                                  "епохата на цар Борис Първи, цар Симеон Велики или цар Самуил, когато този край трайно е " +
                                  "бил в пределите на България. Изображенията, 460 на брой, заели всеки квадратен " +
                                  "сантиметър, са се запазили учудващо добре благодарение на дима от свещите, макар че през " +
                                  "19 век турците превърнали църквата в хамам /баня/. " +
                                  "Много от фреските са свидетелства за патриотичните чувства на техните създатели. " +
                                  "Изобразен е даже загиналият за вярата само няколко десетилетия преди това свети " +
                                  "Георги Нови Софийски. Прави впечатление още, че войниците в редица сцени са " +
                                  "със западно въоръжение - алебарди, шлемове, а корабите са венециански галери - " +
                                  "очевидно отглас от прочутата морска битка през 1571 година при Лепанто, където три " +
                                  "четвърти от екипажите и бойците на венецианския флот са православни българи, гърци и сърби." +
                                  "Стенопис изобразява ктиторите Хасия, Богдан и Спас, както и строителите Станко, " +
                                  "Смилен и Спас. Изобразени са и редица католически светци, между които римският " +
                                  "папа Силвестър, а свети Кирил Александрийски е заменен със свети Кирил Философ - " +
                                  "създателя на старобългарската азбука. Всичко това превръща храма в Добърско в един " +
                                  "от най-ценните бисери в огърлицата на стоте национални туристически обекти. " +
                                  "Църквата е обявена за паметник на културата и е вписана в книгата на ЮНЕСКО.",
                    LocationId = 3
                    // с. Добърско
                },
                new Landmark
                {
                    Name = "Кордопулова къща",
                    Number = 4,
                    Description = "Кордопуловата къща в Мелник, наричана още Цинцаровата къща, " +
                                  "е построена през 1754. Тя е най-голямата възрожденска къща на Балканския " +
                                  "полуостров, която е запазена до днес. Построена е специално за производство, съхранение и " +
                                  "търговия на вино и е принадлежала на богатата гръцка фамилия на търговци Кордопулос.",
                    Information =
                        "В къщата са показани венециански стенописи, дърворезби и стъклописи, както и огромни бъчви " +
                        "за съхранение на мелнишко вино. Къщата е №4 от 100 национални туристически обекта, " +
                        "има печат. Намира се в източната част на града. " +
                        "Пашовата и Болярската къща са разположени на близко разстояние от Кордопуловата къща." +
                        "В къщата, която според някои източници е втора по големина в страната, е изложена " +
                        "мелнишка изба, като тя е издълбана в скалата и така е оформен 150-метров " +
                        "(според друг източник 80-метров) тунел. В избите могат да се поберат 300 тона вино, " +
                        "като най-голямата бъчва побира 12,5 тона. Според Богдан Филов, посетил къщата през " +
                        "лятото на 1916 година, най-голямата бъчва в избата е събирала 240 товара грозде " +
                        "(по 100 оки) или около 30,7 тона. Коридорите са сравнително тесни и на места ниски. " +
                        "Избата разполага със специални канали и вентилационна система. " +
                        "Два от четирите етажа на постройката са изградени от камък. Седем вътрешни " +
                        "стълбища свързват различните етажи и мансарди. В залата влиза светлина през 24-те прозорци, " +
                        "подредени в две редици. Горната редица е от цветно венецианско стъкло, " +
                        "което пропуска меко светлината, падаща върху изрисуваните стени, дърворезби и долапи. " +
                        "Дървените етажи са покрити с пъстри черги. Покрай три стени има места за сядане " +
                        "под еркерните прозорци. Предполага се, че Кордопуловата къща и митрополитската" +
                        " църквата „Свети Николай“ са построени от един и същ майстор. " +
                        "Последният прочут представител на фамилията е Манолис Кордопулос, " +
                        "завършил винопроизводство във Франция, модернизирал отрасъла в Мелник. " +
                        "Той дава убежище на Яне Сандански в дома си в годините преди Първата световна война." +
                        " Убит е от напускащите града турци през 1912 г., в момента в който четата на Яне " +
                        "Сандански влиза в града. Собственик на къщата става Агнеса, която е била или прислужница," +
                        " или сестра на Кордопулос. Омъжва се за Георги Цинцара, но нямат деца. " +
                        "Осиновяват племенника си Гавраил, който е бащата на Никола Паспалев, сегашният стопанин на" +
                        " Кордопуловата къща. През 1974-1980 къщата е реставрирана от арх. Георги Лабов. " +
                        "Днес тя е частен музей и се посещава от 30 000 туристи годишно.",
                    LocationId = 4
                    // гр. Мелник
                },
                new Landmark
                {
                    Name = "Местност \"Рупите\" - храм-паметник \"Света Петка Българска\"",
                    Number = 5,
                    Description = "Рупите е село в Югозападна България." +
                                  " То се намира в община Петрич, Област Благоевград. " +
                                  "Селото се намира на 8 км североизточно от Петрич." +
                                  " До 1951 година носи името Ширбаново, а до 1993 година Мулетарово.",
                    Information = "Село Рупите е разположено в Петричко-Санданската котловина." +
                                  "Отстои на около 8 километра северно от общинския център Петрич. На 2 километра " +
                                  "източно от селото се намира вулканското възвишение Кожух. В източното подножие на " +
                                  "възвишението в землището на селото е разположена известната местност Рупите, известна с " +
                                  "лечебните си минерални извори с температура 75°C. Климатът е преходносредиземноморски с " +
                                  "летен минимум и зимен максимум на валежите. Средната годишна валежна сума е около 700 мм." +
                                  " На 2 километра източно от селото в местността Кожух се намират руините от един от най-" +
                                  "големите антични градове по долината на Струма, съществувал от IV в. пр. Хр. до VI в. " +
                                  "сл. Хр. В досегашните исторически изследвания този град се свързваше с античната Петра. " +
                                  "Откритият тук през 2002 година латински надпис от 308 година сл. Хр. по недвусмислен начин " +
                                  "доказа, че край село Рупите се е намирал античния град Хераклея Синтика, " +
                                  "споменат многократно от античните автори. Досега този град бе локализиран на юг от Беласица." +
                                  "Селището се споменава в османски данъчни регистри от 15 век, 1570 и 1664-1665 година. " +
                                  "През 1570 година Сирбан се числи юридически към махалите на град Петрич. " +
                                  "Според документа в него живеят 28 християнски домакинства. " +
                                  "През 19 век селото е чисто българско, числящо се към Петричка каза. " +
                                  "В „Етнография на вилаетите Адрианопол, Монастир и Салоника“, издадена в Константинопол " +
                                  "в 1878 година и отразяваща статистиката на мъжкото население от 1873, " +
                                  "Ширбан (Chirban) е посочено като село с 40 домакинства, като жителите му са 142 българи. " +
                                  "През 1889-1892 година на мястото на по-стара църква е построена църквата " +
                                  "„Успение Богородично“, чийто иконостас е дело на резбаря Йосиф Йосифов от село Каракьой, " +
                                  "Неврокопско. Според статистиката на Васил Кънчов („Македония. Етнография и статистика“)" +
                                  " към 1900 година Ширбаново е чисто българско село. В него живеят 252 българи-християни." +
                                  " С писмо от 21 февруари 1904 година селският кмет (мухтар) и старейшините на селото се " +
                                  "оплакват на руския императорски цивилен агент в Солун – Николай Демерик от своеволията " +
                                  "на местните турски чифликчиии и го молят да им съдейства за премахването на" +
                                  " съществуващите беззакония. Съгласно статистиката на секретаря на Българската екзархия " +
                                  "Димитър Мишев („La Macédoine et sa Population Chrétienne“) в 1905 година " +
                                  "населението на селото се състои от 304 българи екзархисти. При избухването на Балканската " +
                                  "война през 1912 година двама души от селото са доброволци в Македоно-одринското опълчение." +
                                  " По време на Междусъюзническата война през 1913 година селото е опожарено от гръцките войски." +
                                  "В землището на селото се намира известната местност Рупите, където в последните " +
                                  "години от живота си живееше ясновидката Ванга. Тук през 1994 година, финансиран от " +
                                  "самата Ванга и по проект на архитектите Богдан Томалевски и Лозан Лозанов, " +
                                  "е построен храмът „Св. Петка Българска“ в близост до къщичката, " +
                                  "в която тя е живяла. Предсмъртното желание на Ванга е било тя да бъде погребана " +
                                  "в двора на къщичката си, за да може хората да черпят сили от гроба ѝ, и въпреки " +
                                  "че вече не е сред нас, тя пак да може да помага. Но от фондация „Ванга“ решиха да " +
                                  "не уважат това нейно желание и тя бе погребана до храма „Св. Петка Българска“." +
                                  " Местността Рупите е разположена в подножието на хълма Кожух. Преди " +
                                  "стотици години Кожух е бил вулкан. Чудотворните земи са резултат от изригването " +
                                  "на този вулкан. Известна е с редки дървесни и животински видове, някои " +
                                  "от които са включени в Червената книга на България. " +
                                  "Тук се намират целебни минерални извори и басейни. Има и орнитологична станция, " +
                                  "занимаваща се с движението на мигриращите птици. За това късче земя прочутата " +
                                  "българска пророчица баба Ванга казваше, че е наситено с особена енергия. " +
                                  "Местността Рупите, заедно с храм-паметник „Света Петка Българска“, е част от " +
                                  "Стоте национални туристически обекта на Българския туристически съюз. " +
                                  "Всяка година в Рупите на 15 август, (Успение Богородично) се провежда традиционен събор. " +
                                  "Предлагат се лакомства, играчки и дрехи. Свири се традиционна музика от Югозападна България " +
                                  "и се танцуват местни танци. Популярни спортни мероприятия по " +
                                  "време на събитието са футболът и народната борба. " +
                                  "На името на местността Рупите е именуван ледник Рупите",
                    LocationId = 5
                    // град Петрич
                },
                new Landmark
                {
                    Name = "Самуилова крепост",
                    Number = 6,
                    Description =
                        "Самуилова крепост e името на средновековна крепост, разположена между планините Беласица и " +
                        "Огражден в т.нар. " +
                        "Ключка клисура. Намира се на невисок хълм на десния бряг на река Струмешница," +
                        " на 5 километра северно от село Ключ. Построена е вероятно в периода 1009-1013 " +
                        "година по време на управлението на цар Самуил и е част от мащабна фортификационна система.",
                    Information = "В съчиненията на византийските хронисти от 11 век Йоан Скилица, " +
                                  "Георги Кедрин, Йоан Зонара, Кекавмен и други се известява за преграждането на " +
                                  "Ключката клисура (на гръцки: Κλειδίον, Клидион) с широка преградна стена — дема. " +
                                  "Археологическите изследвания сочат, че демата представлява сложна система от " +
                                  "отбранителни съоръжения, които започват от склоновете на Беласица, южно от село Ключ " +
                                  "и опират на север в слоновете на Огражден. Укрепителните съоръжения се простират " +
                                  "в протежение на повече от 8 километра. Самата крепост, известна по-късно като Самуилова " +
                                  "крепост е само част от тази фортификационна система. " +
                                  "Тя е изградена върху основите на тракийско и раннобългарско славянско селище. " +
                                  "Върху хълма цар Самуил построява землено укрепление, защитено от три вала и два " +
                                  "рова, концентрично разположени. Първият вътрешен вал има сложна конструкция с ядро от " +
                                  "камъни и пръст и скара от дървени греди. Гребенът на вала е завършвал с широка стена, " +
                                  "изградена от ломени камъни, споени с кал. Върху най-високата част на хълма са открити " +
                                  "правоъгълни каменни основи на дървена наблюдателна и отбранителна кула, конструктивно свързана " +
                                  "с каменната стена. Останалите два вала имат единна структура на насипа си. Разположението " +
                                  "на Самуилова крепост позволява да се контролира цялата клисура и да се използва като " +
                                  "команден военно-стратегически пункт на всички сектори на отбранителната система. " +
                                  "Ключката клисура с река Струмешица и Беласица в началото на 20 век. " +
                                  "Във фортификационно отношение укреплението носи белезите на българската укрепителна " +
                                  "традиция, характерна за времето на Първото българско царство. Крепостта се " +
                                  "свързва с ослепяването на българските войни по времето на цар Самуил. " +
                                  "В околностите на крепостта през лятото на 1014 година се е състояла историческата " +
                                  "Беласишка битка, в която българските войски са предвождани от цар Самуил. Войските на " +
                                  "византийския император Василий II разгромяват българската армия и пленяват много войници. " +
                                  "Цар Самуил и неговото обкръжение успяват да се спасят. След края на битката " +
                                  "византийския император ослепява 14-хилядната пленена българска армия, " +
                                  "като на всеки сто души оставя по един едноок водач. През 1916 година по време на " +
                                  "Първата световна война Богдан Филов, като участник в научно-разузнавателната " +
                                  "мисия в Македония и Поморавия, организирана от Щабът на действащата армия, " +
                                  "заедно с Йордан Иванов посещават местата свързани с битката при Беласица. " +
                                  "Той описва описва останките от укреплението и правилно оценява важната му роля в " +
                                  "събитията от 1014 година. Национален парк-музей „Самуилова крепост“ " +
                                  "тържествено е открит на 23 октомври 1982 година. Останките от средновековното " +
                                  "укрепление и селище са консервирани, а района около него е благоустроен. " +
                                  "От паркинга до международния път Петрич — ГКПП „Златарево“ към парка-музей покрай " +
                                  "брега на реката води красива алея. Тя минава по пешеходен мост и се отправя към " +
                                  "подножието на хълма. Отдалеч се вижда величествената бронзовата фигура на цар Самуил " +
                                  "в цял ръст и четирите бетонни пилона изградени в най-високата част на хълма," +
                                  " върху руините от средновековната кула. Автор на паметника е професор Борис Гондов. " +
                                  "Крепостта е важен туристически обект в югозападна България. От 2003 година тя е включена " +
                                  "в списъка от 100 национални туристически обекта на БТС.",
                    LocationId = 6
                    // град Петрич
                },
                new Landmark
                {
                    Name = "Архитектурно-исторически резерват - Архитектурен музей",
                    Number = 7,
                    Description = "Несебър (Месемврия) е един от най-старите български градове, " +
                                  "населен от заселници от град Мегара и нейните колонии Бизантион и " +
                                  "Калхедон в края на VI в. пр. Хр. До идването на българите селището е " +
                                  "било от тракийски и гръцки тип. Градът е включен в пределите на " +
                                  "България през 812 г., когато кан Крум го завладява и населението му " +
                                  "се обогатява със славяни и българи. По късно за по-продължителен " +
                                  "период Несебър (както го наричат славяните) " +
                                  "е отново български при управлението на цар Симеон Велики.",
                    Information = "Археологическите изследвания и разкопки в несебърския " +
                                  "полуостров и района на града през последните четирсет години " +
                                  "разкриват изключителни находки от значими паметници на културата, " +
                                  "свидетелстващи за богатата история на антична Месамбрия и средновековния" +
                                  " Несебър. По тази причина през 1994 г. е открит и археологическият музей в " +
                                  "града и голяма част от експонатите са включени в неговата експозиция, " +
                                  "обхващаща фоайе и 4 зали. Създаден е през 1956 год. и първата му " +
                                  "експозиция е уредена в църквата „Св. Йоан Кръстител”. В новата си сграда, " +
                                  "строена специално за музей по проект на арх. Христо Коев, " +
                                  "той се премества през 1994 год. Тук е уредена експозицията " +
                                  "„Несебър през вековете”, в която са представени многобройни паметници на културата, " +
                                  "илюстриращи историята на античната Месамбрия и средновековния Несебър. " +
                                  "Експозиционната площ на музея обхваща фоайе и четири зали.Той е включен и в " +
                                  "Стоте национални туристически обекта. Във фоайето е изложена дипломата на " +
                                  "ЮНЕСКО, документираща вписването през 1983 г. на старата част на град " +
                                  "Несебър в листата на световното културно наследство. " +
                                  "Сред уникалните артефакти в музея са откритият " +
                                  "изключително важен надпис-декрет в чест на тракийския вожд Садала, " +
                                  "датиран от III в. пр. Хр. и даващ богата информация за " +
                                  "взаимоотношенията на гръцкия полис със съседните траки, както и " +
                                  "експонираното сребърно съкровище от монети-тетрадрахми, в които преобладават " +
                                  "тракийските имитации, което допълва сведенията за ролята на местното " +
                                  "тракийско население в политическия и икономически живот на града през XXI-I в. пр. Хр.",
                    LocationId = 7
                    // град Несебър
                },
                new Landmark
                {
                    Name = "Музей на солта",
                    Number = 8,
                    Description = "Музеят на солта в Поморие е открит на 7 септември 2002 г. " +
                                  "Създаден е с финансовата подкрепа на Европейския съюз чрез програма „Фар“ " +
                                  "в изпълнение на проектите „Всичко за солта (АЛАС)“ – 2001-2002 г. и „Развитие на " +
                                  "Музея на солта в Поморие като завършен обект на културния туризъм“ – 2004-2005 г.",
                    Information = "Многовековният опит се е предавал от бащи на синове. " +
                                  "Музеят представя древната анхиалска технология за производство на морска сол. " +
                                  "Той се състои от експозиционна зала и 25 декара действащи солници. " +
                                  "Разполага с уникална колекция от снимки от началото на миналия век, " +
                                  "проследяваща развитието на солодобива в района, стари топографски карти, " +
                                  "макети и автентични соларски съоръжения и инструменти. " +
                                  "Музеят в Поморие е единственият в България и в Източна Европа " +
                                  "специализиран музей за производството на сол чрез слънчево " +
                                  "изпарение на морска вода. " +
                                  "В Поморие, древният Анхиало, морска сол се добива от незапомнени времена. " +
                                  "Според българските историци, солниците са съществували още преди " +
                                  "основаването на града (около V век пр. Р. Хр.). До 30-те години на " +
                                  "XX век морска сол в България се е добивала само в Поморие. " +
                                  "В миналото солта е била рядкост и по някои места е имала стойността на златото. " +
                                  "Затова анхиалските солници са били предмет на спорове и войни. " +
                                  "През османския период върху добива и тъговията с морска сол е бил " +
                                  "наложен държавен монопол. " +
                                  "Солниците към музея произвеждат сол по същия начин, " +
                                  "както това е ставало в древността. Посетителите могат да видят „на живо“" +
                                  " всички технологични операции, да разговарят със соларите за тънкостите на занаята, " +
                                  "да усетят автентичната атмосфера на миналото.",
                    LocationId = 8
                    // град Поморие
                },
                new Landmark
                {
                    Name = "Поморийско езеро",
                    Number = 9,
                    Description = "Поморийско езеро е естествена свръхсолена лагуна, " +
                                  "разположена на българското Черноморско крайбрежие, в непосредствена " +
                                  "близост до гр. Поморие. Влажната зона предлага рядко съчетание на " +
                                  "условия за живот, които позволяват развитието на много рядък комплекс " +
                                  "от соленолюбива растителност и животни приспособени към тази соленост, част от " +
                                  "които могат да се видят единствено тук",
                    Information = "Разположението на езерото на западния бряг на Черно море, " +
                                  "по протежението на който преминава втория по големина миграционен " +
                                  "път на птиците в Европа Via Pontica обуславя голямото разнообразие от птици " +
                                  "(над 270 вида), което може да се наблюдава през различните сезони на годината. " +
                                  "Богатото биологично разнообразие на Поморийско езеро и съхранения природен ландшафт " +
                                  "са причина влажната зона и прилежащите територии да бъдат защитени съгласно българското " +
                                  "(ЗМ Поморийско езеро) и международното природозащитно законодателство  включено е в " +
                                  "Списъкът на влажните зони с международно значение към Конвенцията за опазването на " +
                                  "влажните зони (Рамсарска конвенция) и в екологичната мрежа на ЕС - Натура 2000. " +
                                  "Посетителски център Поморийско езеро се намира в непосредствена близост с Музей на " +
                                  "Солта, на брега на Поморийско езеро. Целта на посетителският център, " +
                                  "като туристически обект е представянето и популяризирането на богатството и " +
                                  "красотата на биоразнообразието на Поморийско езеро с цел повишаване " +
                                  "природозащитните нагласи на широки слоеве от обществото. Това се осъществява " +
                                  "чрез беседа от екскурзовод, обширна екзпозиция с фотографски пана с текст и " +
                                  "макети, наблюдение на разнообразието от диви птици с телексоп и бинокъл, и " +
                                  "прожектиране на филми. От терасата на центъра се открива просторна гледка към " +
                                  "езерото и най-голямата гнездова колония на Балканския полуостров от редките " +
                                  "гривести рибарки! Интересната история на поддържането и опазването и - резултат от " +
                                  "целенасочени действия на експертите и доброволците от Зелени Балкани възстановили " +
                                  "подходящо местообитание за гнездене на тези редки птици ще научите при посещението " +
                                  "си в центъра!",
                    LocationId = 9
                    // град Поморие
                },
                new Landmark
                {
                    Name = "Природозащитен център \"Пода\"",
                    Number = 10,
                    Description = "Пода е местност около отока (пороса) на Мандренското езеро " +
                                  "към Черно море в землището на град Бургас. " +
                                  "Там се намира единствената смесена чаплова колония в близост до голям град." +
                                  " Местността Пода е разположена на юг от центъра на Бургас по продълженито на " +
                                  "международен път Е87, близо до разклонението му за бургаския квартал Крайморие.",
                    Information = "Пода е първата защитена територия в България, " +
                                  "създадена по предложение на БДЗП и предоставена за управление на неправителствена " +
                                  "организация, като през годините се е утвърдила като модел за устойчива природозащита, " +
                                  "екологично образование и природосъобразен туризъм. На територията на Пода от малко повече " +
                                  "от 1 кв. км са установени 273 вида птици, което е повече от половината от всичките 420 вида" +
                                  ", които се срещат в България въобще! Затова през 1997 г. Българското дружество за " +
                                  "защита на птиците с помощта на Правителството на Швейцария изгради тук " +
                                  "първия в България Природозащитен център (ПЗЦ) Пода като средище за природозащита, " +
                                  "екологично образование, екотуризъм и орнитологична информация. За посещения защитената " +
                                  "местност Пода е отворена целогодишно. В нея редките видове птици могат да бъдат " +
                                  "наблюдавани без да бъдат обезпокоявани, както от терасите на Природозащитния " +
                                  "център на БДЗП с бинокли и далекогледна тръба, така и по обособен маршрут. " +
                                  "Има специално укритие, което дава възможност за наблюдение и фотографиране " +
                                  "независимо от метеорологичните условия. Ежегодно в ПЗЦ на БДЗП Пода се провеж" +
                                  "дат проучвания върху мигриращите птици, а най-добрите месеци за наблюдение на ми" +
                                  "грантите са март, април, май, август, септември и октомври. Интересни и редки видове " +
                                  "птици, включително пеликани, морски орли, малки корморани и други обаче могат да се " +
                                  "наблюдават по всяко време на годината.",
                    LocationId = 10
                    // град Бургас
                },
                new Landmark
                {
                    Name = "Историческа местност \"Петрова нива\"",
                    Number = 11,
                    Description = "Историческият музей в Малко Търново е създаден през 1983 г. " +
                                  "Експозицията му е разположена в четири къщи с типична възрожденска " +
                                  "архитектура, паметници на културата. " +
                                  "Обект на историческия музей в Малко Търново е и " +
                                  "мемориалният национален паметник Петрова нива.",
                    Information = "Преди създаването на музея местни учители създават училищна " +
                                  "сбирка от археологически материали. Експозиция, посветена на " +
                                  "Илинденско-Преображенското въстание е уредена в читалището. " +
                                  "Предметите открити по време на водената от проф. Александър Фол експедиция " +
                                  "„Странджа“, и тези от уредените експозиции, дават основата на исторически музей. " +
                                  "Музеят е създаден на 23 август 1983 г. като „Музеен комплекс Странджа“. " +
                                  "През 2002 г. е преструктуриран в Общински исторически музей. " +
                                  "Музеят обхваща четири странджански възрожденски къщи, принадлежащи на търговските " +
                                  "фамилии Дякови и Илиеви от края на 19 в. В музея се представят шест " +
                                  "експозиции. В експозициите е нарушен традиционният способ на експониране в " +
                                  "строго следване на хронологическия ред. То е осъществено тематично и с акцентуване " +
                                  "само на събитията и явленията, които са характерни за странджанския регион. " +
                                  "Представя се материалната и духовна култура на местното население от периода " +
                                  "Х-ІХ в. пр. н.е. до наши дни. Към историческия музей функционира килимарска " +
                                  "работилница, където се предлагат демонстрации на тъкане на автентичен стан. " +
                                  "По-голямата част от експонатите са открити при водената от проф. " +
                                  "Александър Фол програма „Странджа-Сакар“. В негова памет е представена " +
                                  "документална изложба в музея. Епиграфските паметници са подредени в " +
                                  "лапидариум в двора на музея. Тук могат да се видят мраморни надгробни плочи, " +
                                  "жертвеници, колони с гръцки надписи и мраморна статуя на римска девойка, два " +
                                  "фронтона от тракийска куполна гробница, керамика. " +
                                  "В тази експозиция се представя новата история на Малко Търново и историята на " +
                                  "Илинденско-Преображенското въстание от 1903 г. Национално-" +
                                  "освободителното движение е представено чрез копия на снимки, " +
                                  "документи и оръжия. " +
                                  "Етнографската експозиция е уредена през 2010 г. в къщата на " +
                                  "един от идеолозите на Илинденско-Преображенското въстание " +
                                  "капитан Стамат Икономов. В нея са събрани автентични предмети и облекла за " +
                                  "източнорупската етнографска област.",
                    LocationId = 11
                    // град Малко Търново
                },
                new Landmark
                {
                    Name = "Археологически музей",
                    Number = 12,
                    LocationId = 12
                    // град Созопол
                },
                new Landmark
                {
                    Name = "Общински исторически музей",
                    Number = 13,
                    LocationId = 13
                    // град Царево
                },
                new Landmark
                {
                    Name = "Военноморски музей",
                    Number = 14,
                    LocationId = 14
                    // град Варна
                },
                new Landmark
                {
                    Name = "Музей на мозайките",
                    Number = 15,
                    LocationId = 15
                    // град Девня
                },
                new Landmark
                {
                    Name = "Архитектурно - исторически резерват \"Царевец\"",
                    Number = 16,
                    LocationId = 16
                    // град Велико Търново
                },
                new Landmark
                {
                    Name = "Архитектурно - музеен резерват \"Арбанаси\"",
                    Number = 17,
                    LocationId = 17
                    // град Велико Търново
                },
                new Landmark
                {
                    Name = "Къща-музей \"Алеко Константинов\"",
                    Number = 18,
                    LocationId = 18
                    // град Свищов
                },
                new Landmark
                {
                    Name = "Музей-крепост \"Баба Вида\"",
                    Number = 19,
                    LocationId = 19
                    // град Видин
                },
                new Landmark
                {
                    Name = "Пещера \"Магурата\"",
                    Number = 20,
                    LocationId = 20
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Белоградчишки скали и крепост",
                    Number = 21,
                    LocationId = 21
                    // Белоградчик
                },
                new Landmark
                {
                    Name = "Пещера \"Леденика\"",
                    Number = 22,
                    LocationId = 22
                    // Враца
                },
                new Landmark
                {
                    Name = "връх Околчица - Лобното място на Христо Ботев",
                    Number = 23,
                    LocationId = 23
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Национален музей \"Параход Радецки\"",
                    Number = 24,
                    LocationId = 24
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Музей на образованието",
                    Number = 25,
                    LocationId = 25
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Архитектурно-исторически резерват",
                    Number = 26,
                    LocationId = 26
                    // Бпженци
                },
                new Landmark
                {
                    Name = "Специализиран музей на резбарско и зографско изкуство",
                    Number = 27,
                    LocationId = 27
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Дряновски манастир",
                    Number = 28,
                    LocationId = 28
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Музей \"Кольо Фичето\" ",
                    Number = 29,
                    LocationId = 29
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Архитектурно-парков комплекс \"Двореца\"",
                    Number = 30,
                    LocationId = 30
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Нос Калиакра - археологически резерват \"Калиакра\"",
                    Number = 31,
                    LocationId = 31
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Манастирски комплекс \"Св. Йоан Предтеча\"",
                    Number = 32,
                    LocationId = 32
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Перперикон",
                    Number = 33,
                    LocationId = 33
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Къща-музей \"Димитър Пешев\"",
                    Number = 34,
                    LocationId = 34
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Регионален исторически музей",
                    Number = 35,
                    LocationId = 35
                    // Благоевград
                },
                new Landmark
                {
                    Name = "Връх Руен",
                    Number = 36,
                    LocationId = 36
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Музей Рилски манастир в Рилска света обител",
                    Number = 37,
                    LocationId = 37
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Стобски пирамиди",
                    Number = 38,
                    LocationId = 38
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Хижа „Скакавица“ и Седемте рилски езера",
                    Number = 39,
                    LocationId = 39
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Музей „Васил Левски“",
                    Number = 40,
                    LocationId = 40
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Национален пещерен дом",
                    Number = 41,
                    LocationId = 41
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Природонаучен музей - с. Черни Осъм",
                    Number = 42,
                    LocationId = 42
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Исторически музей",
                    Number = 43,
                    LocationId = 43
                    // тетевен
                },
                new Landmark
                {
                    Name = "Пещера \"Съева дупка\"",
                    Number = 44,
                    LocationId = 44
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Етнографски музей",
                    Number = 45,
                    LocationId = 45
                    // berkovica
                },
                new Landmark
                {
                    Name = "Къща-музей \"Станислав Доспевски\" ",
                    Number = 46,
                    LocationId = 46
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Историческа местност \"Оборище\"",
                    Number = 47,
                    LocationId = 47
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Пещера \"Снежанка\"",
                    Number = 48,
                    LocationId = 48
                    // Стара планина
                },
                new Landmark
                {
                    Name = "Исторически музей",
                    Number = 49,
                    LocationId = 49
                    // батак 
                },
                new Landmark
                {
                    Name = "Ждрелото на р. Ерма",
                    Number = 50,
                    LocationId = 50
                    // Стара планина
                },
            };
        }
        #endregion

#region Pictures
        public static List<Picture> GetPictures()
        {
            return new List<Picture>
            {
                new Picture
                {
                    Name = "Магурата",
                    ImageData =
                        File.ReadAllBytes(HttpContext.Current.Server.MapPath(Resources.ImagesSeed + "Magurata.jpg")),
                    LandmarkId = 20
                },
                new Picture
                {
                    Name = "Крепост Баба Вида",
                    ImageData =
                        File.ReadAllBytes(HttpContext.Current.Server.MapPath(Resources.ImagesSeed + "baba-vida.jpg")),
                    LandmarkId = 19
                },
                new Picture
                {
                    Name = "Царевец",
                    ImageData =
                        File.ReadAllBytes(HttpContext.Current.Server.MapPath(Resources.ImagesSeed + "tsarevets.jpg")),
                    LandmarkId = 16
                }
            };
        }

        public static List<IdentityRole> GetRoles()
        {
            return new List<IdentityRole>
            {
                new IdentityRole
                {
                    Name = "Admin"
                }
            };
        }
        #endregion

#region UserRoles
        public static List<IdentityUserRole> AsignAdminRole()
        {
            using (var context = new DeltaDucksContext())
            {
                return new List<IdentityUserRole>
                {
                    new IdentityUserRole
                    {
                        UserId = context.Users.FirstOrDefault(u => u.UserName == "admin").Id,
                        RoleId = context.Roles.FirstOrDefault(r => r.Name == "Admin").Id,
                    }
                };
            }
        }
#endregion

#region Users

        public static List<ApplicationUser> GetUsers(DeltaDucksContext context)
        {

            var store = new UserStore<ApplicationUser>(context);
            var manager = new UserManager<ApplicationUser>(store);
            var users = new List<ApplicationUser>
            {
                new ApplicationUser
                {
                    UserName = "johnDoe",
                    FirstName = "John",
                    LastName = "Doe",
                    Email = "johnDoe@yahoo.com"
                },
                new ApplicationUser
                {
                    UserName = "jimmy",
                    FirstName = "Jim",
                    LastName = "Roggers",
                    Email = "jimmy@gmail.com"
                }
            };
            users.ForEach(user => manager.Create(user,"asd123"));
            return users;
        }
#endregion

#region Comments

        public static List<Comment> GetComments(List<ApplicationUser> users)
        {
            return new List<Comment>
            {
                new Comment
                {
                    Text = "Силно препоръчвам.",
                    Author = users[0],
                    LandmarkId = 1,
                    DateCreated = DateTime.Now
                },
                new Comment
                {
                    Text = "Красиво.",
                    Author = users[0],
                    LandmarkId = 2,
                    DateCreated = DateTime.Now
                },
                new Comment
                {
                    Text = "Прекрасна гледка.",
                    Author = users[1],
                    LandmarkId = 1,
                    DateCreated = DateTime.Now
                },
                new Comment
                {
                    Text = "Силно препоръчвам",
                    Author = users[1],
                    LandmarkId = 10,
                    DateCreated = DateTime.Now
                },
                new Comment
                {
                    Text = "C'est magnifique!",
                    Author = users[1],
                    LandmarkId = 2,
                    DateCreated = DateTime.Now
                },
                new Comment
                {
                    Text = "Не мога да измисля коментар.",
                    Author = users[0],
                    LandmarkId = 10,
                    DateCreated = DateTime.Now
                },
            };
        }
#endregion
    }
}